# THIS FILE IS AUTOMATICALLY GENERATED
# Project: E:\Acads\UWM\Summer 25\PathController\PathController.cydsn\PathController.cyprj
# Date: Sat, 26 Jul 2025 04:38:36 GMT
#set_units -time ns
create_clock -name {UART_DBG_SCBCLK(FFB)} -period 718.75 -waveform {0 359.375} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {UART_GPS_SCBCLK(FFB)} -period 718.75 -waveform {0 359.375} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {UART_FC_SCBCLK(FFB)} -period 718.75 -waveform {0 359.375} [list [get_pins {ClockBlock/ff_div_5}]]
create_clock -name {CyRouted1} -period 31.25 -waveform {0 15.625} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyLFClk} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 31.25 -waveform {0 15.625} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 31.25 -waveform {0 15.625} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 31.25 -waveform {0 15.625} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {UART_DBG_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 23 47} [list]
create_generated_clock -name {UART_GPS_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 23 47} [list]
create_generated_clock -name {UART_FC_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 23 47} [list]


# Component constraints for E:\Acads\UWM\Summer 25\PathController\PathController.cydsn\TopDesign\TopDesign.cysch
# Project: E:\Acads\UWM\Summer 25\PathController\PathController.cydsn\PathController.cyprj
# Date: Sat, 26 Jul 2025 04:38:33 GMT
